Tekla Open API Reference for Tekla Structures 2025
ReinforcementSelectionForm.SelectedUsage Property
 Gets the selected usage.
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string SelectedUsage { get; set; }
Public Property SelectedUsage As String
	Get
	Set
Property Value
Type: String
See Also
Reference
ReinforcementSelectionForm Class
Tekla.Structures.Dialog.UIControls Namespace